In [9]:
import numpy as np
import pandas as pd

In [10]:
from numpy.random import randn

In [4]:
# create a random seed export
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
# A single column call will give the ga
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
type(df['W'])

In [11]:
# If you enter a list of the columns you will get back another data frame
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [12]:
# You can also add a column to a preexisting data frame like this
df['new']  = df['W'] + df['Y']

In [13]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [15]:
# To remove a column you can use df.drop method and specify the axis as 1
# Warning: Drop does not occur in place so it does not alter the original data frame
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
# To make the change persistent 
df.drop('new', axis=1, inplace = True)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
# This can also be done on rows
df.drop('E',axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [24]:
df.shape # this gives you rows and columns

(5, 4)

In [27]:
# We can get values from a row with numerical position using the loc and iloc methods
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [28]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
df['C']

KeyError: 'C'

In [34]:
# Use I loc to get a specific set of values rows and columns included.
df.loc[['A','B'],['W','X'] ]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [35]:
# Part 2 conditional selection 
# find the elements that are over 0

In [36]:
booldf = df>0

In [37]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [38]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [41]:
# passing in only a column boolean filter will remove the null rows
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
result_df = df[df['W']>0]

In [43]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [44]:
# You can stack the commands for the data columns

df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [46]:
boolser = df['W'] >0
result = df[boolser]
mycols = ['X','Y']
result[mycols]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [47]:
# Now lets do multiple conditions

In [48]:
df[(df['W']>0) and (df['Y']>1)] # This will give an ambiguous series error

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [49]:
# You need to use the &(ampersand operator) and the |(Vertical bar) to resolve these issues

df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [50]:
# You can change the index to numerical values by using the reset_index method
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [52]:
# Now let's try to replace the indecies entirely
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [54]:
df['States'] = newind

In [55]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [56]:
df.set_index('States') # This will not be persitent unless the inplace value is true

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [11]:
# Part 3 Data frame hierarchy
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [12]:
list(zip(inside,outside))

[(1, 'G1'), (2, 'G1'), (3, 'G1'), (1, 'G2'), (2, 'G2'), (3, 'G2')]

In [14]:
df1 = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df1

             A         B
G1 1 -0.106429 -0.390004
   2  0.798562  0.812936
   3  0.217412  0.907608
G2 1  1.830299 -1.648870
   2 -0.182716 -2.120280
   3  0.215573  0.491586

In [6]:
# now let's try to call data from both indecies
df1.loc['G1'].iloc[1]

A    0.836256
B    0.470503
Name: 2, dtype: float64

In [15]:
# Name your indecies

df1.index.names = ['Groups','Num']

In [16]:
df1

                   A         B
Groups Num
G1     1   -0.106429 -0.390004
       2    0.798562  0.812936
       3    0.217412  0.907608
G2     1    1.830299 -1.648870
       2   -0.182716 -2.120280
       3    0.215573  0.491586

In [19]:
df1.loc['G1'].iloc[1].loc['B']

0.8129357062580589

In [21]:
# You can also grab a cross section with the xs method
df1.xs(1,level='Num')

               A         B
Groups
G1     -0.106429 -0.390004
G2      1.830299 -1.648870